Meta:

Narrative:
As a user
I want to perform an action
So that I can achieve a business goal

Scenario: YandexScenario
Given открыта главная страница
When когда открыта главная страница
Then проверяем загрузилась ли она правильно
When когда загружена страница яндекс Маркета
Then проверка загрузки
When когда загружена страница Электроники
Then проверка странцы
When загружена страница с Наушниками
Then проверка загрузки страницы с Наушниками
Then задать параметр поиска от 5000 рублей
Then выбрать производителей Beats
When нажата кнопка применить
Then проверка количества элементов
Then взаписать Имя товара
Then Ввести значение в поисковую строку
When Когда нашли элемент
Then сравнение